//数据结构 
//数据结构基本概念   线性表   栈和队列   串   数组和广义表   树和二叉树   图   查找   排序
/*1.数据结构基本概念
数据：是信息的载体，是对客观事物的符号表示，是所有能输入到计算机中并被计算机程序处理的符号集合。
数据元素：是组成数据的基本单位。在计算机中通常作为一个整体进行考虑和处理。
数据对象：是性质相同的数据元素的集合，是数据的一个子集。
数据结构：是相互之间存在一种或多种特定关系的数据元素的集合，它包括数据元素的集合和元素间关系的集合（即数据的组织形式）。

数据结构主要研究数据的逻辑结构、存储结构、施加在该数据结构上的操作及其相应算法
数据的逻辑结构：集合、线性结构、非线性结构（树、图）    数据的存储结构：顺序存储结构和链式存储结构

数据类型 
抽象数据类型：ADT，是指一个数学模型以及定义在该模型上的一组操作。
抽象数据类型的表现与实现：通过c语言作为描述工具来实现抽向数据类型first，通过结构体将int、float、char等基本数据类型组合到一
起，构成一个结构体类型，再用c语言中typedef自定义类型来为该类型或该类型指针重新起名。second，用c语言子函数实现各个基本操作。
顺序存储结构的类型定义：
#define MAXSIZE 100
typedef struct{
int elem[MAXSIE];
int length;
}Sqlist;
链式存储结构的类型定义：
typedef struct LNode{
int data;
srcut LNode *next;
}LNode,*Linklist;

算法的定义及其特点    算法要求高效率（执行时间短）和低存储量（算法执行过程中所需要的最大存储空间）
时间复杂度和空间复杂度 
*/
/*2.线性表*/
/*3.栈和队列*/
/*4.串*/
/*5.数组和广义*/
/*6.树和二叉树*/
/*7.图*/
/*8.查找*/
/*9.排序*/ 
