//chapter7 数组
//一维数组的定义和引用   一维数组的存储和初始化   一维数组的应用    二维数组的定义和引用   二维数组的存储和初始化   二维数组的应用
//数据排序   数组元素作为函数参数   二维数组作为函数参数    综合应用实例
/*1.一维数组的定义和引用   定义：数据类型名 数组名[元素个数];   引用：数组名[下标]   数组定义时的元素个数要是整型常量表达式，而不
能是变量；数组引用时的下标可以是变量，其取值范围是[0，元素个数-1]
*/
/*2.一维数组的存储和初始化   数组名a表示连续存储单元的首地址&a[0]    初始化：类型名 数组名[元素个数]={初值表};  有3种赋值方式 */
/*3.一维数组的应用   
#include<stdio.h>
int main()
{
	int i,j,fib[20];
	fib[0]=1;fib[1]=1;
	printf("%-6d%-6d",fib[0],fib[1]);
	for(i=2;i<20;i++)
	{
		fib[i]=fib[i-1]+fib[i-2];
		printf("%-6d",fib[i]);
		if((i+1)%5==0) printf("\n");
	}
	return 0;
}
*/
/*4.二维数组的定义和引用   定义：数据类型 数组名[行数][列数]；   引用：数组名[行下标][列下标]   */
/*5.二维数组的存储和初始化   c语言规定，二维数组元素按行存储，即一行接一行存储   二维数组初始化，有4种赋初值方式  */
/*6.二维数组的应用  
#include<stdio.h>
int main()
{
	int i,j,a[3][4];
	printf("请输入12个整数：");
	for(i=0;i<3;i++)
	{
		for(j=0;j<4;j++) scanf("%d",&a[i][j]);
	 } 
	 printf("原二维数组：\n");
	for(i=0;i<3;i++)
	{
		for(j=0;j<4;j++) printf("%5d",a[i][j]);
		printf("\n");
	 }
	 printf("转置二维数组：\n");
	 for(j=0;j<4;j++)
	{
		for(i=0;i<3;i++) printf("%5d",a[i][j]);
		printf("\n");
	 }
	return 0; 
} 
******************注意除了字符类型，其他类型的数组不能用数组名来整体性的输出它的全部元素，只能逐个元素输出，用for循环**********
#include<stdio.h>
int main()
{
	char a[3]={'a','b','c'}; 
	printf("%s\n",a);
	return 0; 
}
*/
/*7.数据排序   交换排序法：在N个数中找到最小值，存入a[0]中；在N-1个数中找到最小值，存入a[1]中；......   
选择排序法：在交换排序法里由俩层循环，选择排序法只是在内循环里找到该轮循环中的最小值的下标就可以了
选择排序法和交换排序法相比，只是在最后进行交换，节省了每次循环都交换一下的时间   
冒泡排序法：通过多轮比较，将小的“冒泡”，大的“沉底”   */
/*8.数组元素作为函数参数（值传递）   一维数组作为函数参数（地址传递）   二维数组作为函数参数（地址传递）   */
/*9.综合应用实例
例1：杨辉三角 
#include<stdio.h>
#define N 10
int main()
{
	int i,j,a[N][N]={0};
	for(i=0;i<N;i++)
	{
		a[i][0]=1;a[i][i]=1;
	}
	for(i=2;i<N;i++)
	{
		for(j=1;j<i;j++) a[i][j]=a[i-1][j-1]+a[i-1][j];
	}
	printf("杨辉三角：\n");
	for(i=0;i<N;i++)
	{
		for(j=0;j<=i;j++) printf("%5d",a[i][j]);
		printf("\n");
	}
	return 0; 
}
例2：冒泡排序法
 #include<stdio.h>
 int count=0;//交换次数 
 int cout=0;//中间量，控制量 
 int countn=0;//循环次数，除以9得到的数字为冒泡轮数 
int main()
{
	int i,j,a[10],mid;
	printf("请输入一组要排序的整数："); 
	for(i=0;i<10;i++){
		scanf("%d",&a[i]);
	}
	for(i=0;i<10;i++){
	    for(j=0;j<9;j++){
	    	countn++;
			if(a[j]>a[j+1]){
				mid=a[j+1];a[j+1]=a[j];a[j]=mid;count++;
			}
		  }
		  if(count==cout) break;
		  cout=count;  
	}
	for(i=0;i<10;i++){
		printf("%3d",a[i]);
	}
	printf("\n%d,%d,%d\n",count,cout,countn);
	return 0; 
}
*/


